# Lecture 06

In [1]:
# Run this cell to set up imports
import numpy as np
import pandas as pd

In [2]:
%reload_ext sql

In [3]:
%sql postgresql://127.0.0.1:5432/postgres

# Manager demo

Creating the manager relation

In [3]:
%sql DROP TABLE IF EXISTS Manager;

Running query in 'postgresql://127.0.0.1:5432/postgres'

++
||
++
++

In [5]:
%%sql
CREATE TABLE Manager (
    manager_name VARCHAR(20),
    age INTEGER DEFAULT 50,
    manager_id CHAR(4),
    PRIMARY KEY (manager_id),
    UNIQUE (manager_name)
);


/***********/
SELECT * FROM Manager;

Running query in 'postgresql://127.0.0.1:5432/postgres'

+--------------+-----+------------+
| manager_name | age | manager_id |
+--------------+-----+------------+
+--------------+-----+------------+

<br/><br/><br/>

Add a tuple (success)

In [7]:
%%sql
INSERT INTO Manager
    (age, manager_id)
VALUES
    (23, 'sd45'),
    (23, 'AB')
;

/***********/
SELECT * FROM Manager;

Running query in 'postgresql://127.0.0.1:5432/postgres'

2 rows affected.

2 rows affected.

+--------------+-----+------------+
| manager_name | age | manager_id |
+--------------+-----+------------+
|     None     |  23 |    sd45    |
|     None     |  23 |    AB      |
+--------------+-----+------------+

<br/><br/><br/>

Add a tuple (failure)

In [8]:
%%sql
INSERT INTO Manager
    (manager_name, age)
VALUES
    ('John Smith', 123);
    
/***********/
SELECT * FROM Manager;

Running query in 'postgresql://127.0.0.1:5432/postgres'

RuntimeError: (psycopg2.errors.NotNullViolation) null value in column "manager_id" of relation "manager" violates not-null constraint
DETAIL:  Failing row contains (John Smith, 123, null).

[SQL: INSERT INTO Manager
    (manager_name, age)
VALUES
    ('John Smith', 123);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

<br/><br/><br/>

Change schema: add attributes

In [18]:
%%sql
ALTER TABLE Manager
DROP address,
DROP income,
ADD address VARCHAR (20),
ADD income REAL DEFAULT 1000000.0;

/***********/
SELECT * FROM Manager;

Running query in 'postgresql://127.0.0.1:5432/postgres'

4 rows affected.

+--------------+-----+------------+---------+-----------+
| manager_name | age | manager_id | address |   income  |
+--------------+-----+------------+---------+-----------+
|     None     |  23 |    sd45    |   None  | 1000000.0 |
|     None     |  23 |    sd45    |   None  | 1000000.0 |
|     None     |  23 |    AB      |   None  | 1000000.0 |
|  John Smith  | 123 |    None    |   None  | 1000000.0 |
+--------------+-----+------------+---------+-----------+

What if we want to add a timestamp?

In [19]:
%%sql
ALTER TABLE Manager
    ADD time_in TIME;

Running query in 'postgresql://127.0.0.1:5432/postgres'

++
||
++
++

In [22]:
%%sql
INSERT INTO Manager(time_in) VALUES
('13:10:00')
;

Running query in 'postgresql://127.0.0.1:5432/postgres'

RuntimeError: (psycopg2.errors.InvalidDatetimeFormat) invalid input syntax for type time: "13 10-00"
LINE 2: ('13 10-00')
         ^

[SQL: INSERT INTO Manager(time_in) VALUES
('13 10-00')
;]
(Background on this error at: https://sqlalche.me/e/20/9h9h)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [21]:
%sql SELECT * FROM Manager;

Running query in 'postgresql://127.0.0.1:5432/postgres'

5 rows affected.

+--------------+-----+------------+---------+-----------+----------+
| manager_name | age | manager_id | address |   income  | time_in  |
+--------------+-----+------------+---------+-----------+----------+
|     None     |  23 |    sd45    |   None  | 1000000.0 |   None   |
|     None     |  23 |    sd45    |   None  | 1000000.0 |   None   |
|     None     |  23 |    AB      |   None  | 1000000.0 |   None   |
|  John Smith  | 123 |    None    |   None  | 1000000.0 |   None   |
|     None     |  50 |    None    |   None  | 1000000.0 | 13:10:00 |
+--------------+-----+------------+---------+-----------+----------+

<br/><br/><br/>

Change schema: drop attributes

In [ ]:
%%sql
ALTER TABLE Manager
DROP address,
DROP income;

/***********/
SELECT * FROM Manager;

<br/><br/><br/>

Delete the relation entirely

In [ ]:
%%sql
DROP TABLE Manager;

In [ ]:
%sql
/***********/
SELECT * FROM Manager;

In [19]:
%%sql
DROP TABLE IF EXISTS Stops;
CREATE TABLE Stops(
  stopID INTEGER,
  personID INTEGER,
  stopTime TIMESTAMP,
  race VARCHAR(10),
  location VARCHAR(20) NOT NULL, 
  age INTEGER,
  arrest BOOLEAN DEFAULT False, 
  PRIMARY KEY (stopID),
  UNIQUE (personID, stopTime)
  );

Running query in 'postgresql://127.0.0.1:5432/postgres'

++
||
++
++

In [20]:
%sql SELECT * FROM Stops;

Running query in 'postgresql://127.0.0.1:5432/postgres'

+--------+----------+----------+------+----------+-----+--------+
| stopid | personid | stoptime | race | location | age | arrest |
+--------+----------+----------+------+----------+-----+--------+
+--------+----------+----------+------+----------+-----+--------+

In [23]:
%%sql
INSERT INTO Stops
    (stopID, personID, stopTime, location, arrest)
VALUES
    -- (0543, 1234, '2023-09-12 13:43:00', 'Oakland')
    (9999, 8888, '2023-09-12 13:43:00', 'Oakland', NULL)
;
SELECT * FROM Stops;

Running query in 'postgresql://127.0.0.1:5432/postgres'

1 rows affected.

2 rows affected.

+--------+----------+---------------------+------+----------+------+--------+
| stopid | personid |       stoptime      | race | location | age  | arrest |
+--------+----------+---------------------+------+----------+------+--------+
|  543   |   1234   | 2023-09-12 13:43:00 | None | Oakland  | None | False  |
|  9999  |   8888   | 2023-09-12 13:43:00 | None | Oakland  | None |  None  |
+--------+----------+---------------------+------+----------+------+--------+

## Actor/Cast_info

In [ ]:
%reload_ext sql

In [ ]:
%sql postgresql://127.0.0.1:5432/postgres

In [7]:
%%sql
DROP TABLE IF EXISTS Actor CASCADE;
DROP TABLE IF EXISTS Movie CASCADE;
DROP TABLE IF EXISTS Cast_info;

CREATE TABLE Actor (
  id INTEGER,
  name TEXT,
  PRIMARY KEY(id)
); 

CREATE TABLE Movie (
  id INTEGER,
  title TEXT,
  PRIMARY KEY(id)
); 

CREATE TABLE Cast_info (
  person_id INTEGER,
  movie_id INTEGER, 
  FOREIGN KEY (person_id)
    REFERENCES Actor (id)
    ON DELETE SET NULL
    ON UPDATE CASCADE,
  FOREIGN KEY (movie_id)
    REFERENCES Movie (id)
    ON DELETE SET NULL);

INSERT INTO Actor VALUES
    (1, 'Tom Hanks'),
    (3, 'Michelle Yeoh')
;

INSERT INTO Movie VALUES
    (23, 'Forrest Gump'),
    (45, 'Tomorrow Never Dies')
;

INSERT INTO Cast_info VALUES
    (1, 23),
    (3, 45)
;

Running query in 'postgresql://127.0.0.1:5432/postgres'

2 rows affected.

2 rows affected.

2 rows affected.

++
||
++
++

In [5]:
%%sql
SELECT * FROM Cast_info;

Running query in 'postgresql://127.0.0.1:5432/postgres'

2 rows affected.

+-----------+----------+
| person_id | movie_id |
+-----------+----------+
|     1     |    23    |
|     3     |    45    |
+-----------+----------+

A. What if weâ€¦ Delete a tuple from Actor corresponding to id = 1?

In [ ]:
%%sql
DELETE FROM Actor
WHERE id = 1;

In [ ]:
%%sql
SELECT * FROM Cast_info;

(note: reset table layout for each choice)

B. Change a tuple in Actor from id = 1 to id = 2?

In [6]:
%%sql
UPDATE Actor
SET id = 2
WHERE id = 1;

Running query in 'postgresql://127.0.0.1:5432/postgres'

1 rows affected.

++
||
++
++

In [ ]:
%%sql
SELECT * FROM Actor;

In [ ]:
%%sql
SELECT * FROM Cast_info;

C. Delete a tuple from Movie corresponding to id = 23?

In [ ]:
%%sql
DELETE FROM Movie
WHERE id = 23;

In [ ]:
%%sql
SELECT * FROM Cast_info;

D. Change a tuple in Movie from id = 23 to id = 24?

In [ ]:
%%sql
UPDATE Movie
SET id = 24
WHERE id = 23;

E. Insert a tuple into Cast_info that adds a new person_id not found in Actor?

In [8]:
%%sql
INSERT INTO Cast_info VALUES
    (467, 23)
;

Running query in 'postgresql://127.0.0.1:5432/postgres'

RuntimeError: (psycopg2.errors.ForeignKeyViolation) insert or update on table "cast_info" violates foreign key constraint "cast_info_person_id_fkey"
DETAIL:  Key (person_id)=(467) is not present in table "actor".

[SQL: INSERT INTO Cast_info VALUES
    (467, 23)
;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community